# Método GroupBy

- 1. Agrupamento de Dados
    - usando groupby
    - agg()

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [2]:
# criando um dataframe

data = {'Empresa':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Venda':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## 1. Agrupamento de dados

In [3]:
group = df.groupby('Empresa')

In [4]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
group

In [6]:
# Soma de vendas por empresa
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [7]:
# Soma de vendas por empresa
group.agg({'Venda':'sum'})

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [8]:
# Soma de vendas por empresa
group.agg({'Venda':['sum','min', 'max', 'std', 'median','unique', 'nunique']})

        Venda
          sum  min  max         std median      unique nunique
Empresa
FB        593  243  350   75.660426  296.5  [243, 350]       2
GOOG      320  120  200   56.568542  160.0  [200, 120]       2
MSFT      464  124  340  152.735065  232.0  [340, 124]       2

In [9]:
# Apresenta uma descrição estatística da tabela incluíndo count, mean, std
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [10]:
group.agg(pd.Series.mode)

C:\Users\kelvin\AppData\Local\Temp\ipykernel_11128\4174012933.py:1: FutureWarning: ['Venda'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  group.agg(pd.Series.mode)

                   Nome
Empresa
FB        [Carl, Sarah]
GOOG     [Charlie, Sam]
MSFT     [Amy, Vanessa]

In [11]:
group.first()

         Nome  Venda
Empresa
FB       Carl    243
GOOG      Sam    200
MSFT      Amy    340

In [12]:
group.last()

            Nome  Venda
Empresa
FB         Sarah    350
GOOG     Charlie    120
MSFT     Vanessa    124

In [13]:
group.apply(lambda grp: grp.count() / df.shape[0])

          Empresa      Nome     Venda
Empresa
FB       0.333333  0.333333  0.333333
GOOG     0.333333  0.333333  0.333333
MSFT     0.333333  0.333333  0.333333